``` sql
CREATE TABLE bankstatement (
    txndate DATE,
    status VARCHAR(10),
    amount INT
);

INSERT INTO bankstatement VALUES (STR_TO_DATE('11-01-2022','%d-%m-%Y'), 'credit', 1000);
INSERT INTO bankstatement VALUES (STR_TO_DATE('11-02-2022','%d-%m-%Y'), 'debit', 150);
INSERT INTO bankstatement VALUES (STR_TO_DATE('11-03-2022','%d-%m-%Y'), 'credit', 160);
INSERT INTO bankstatement VALUES (STR_TO_DATE('11-04-2022','%d-%m-%Y'), 'credit', 200);
INSERT INTO bankstatement VALUES (STR_TO_DATE('20-04-2022','%d-%m-%Y'), 'debit', NULL);
INSERT INTO bankstatement VALUES (STR_TO_DATE('25-04-2022','%d-%m-%Y'), 'debit', 80);
INSERT INTO bankstatement VALUES (STR_TO_DATE('11-05-2022','%d-%m-%Y'), 'debit', 300);

``` sql
select * from bankstatement;
+------------+--------+--------+
| txndate    | status | amount |
+------------+--------+--------+
| 2022-01-11 | credit |   1000 |
| 2022-02-11 | debit  |    150 |
| 2022-03-11 | credit |    160 |
| 2022-04-11 | credit |    200 |
| 2022-04-20 | debit  |   NULL |
| 2022-04-25 | debit  |     80 |
| 2022-05-11 | debit  |    300 |
+------------+--------+--------+

Q.Write an SQL query to get the net balance for the below data.

expected output:

+------------+---------+
| txndate    | balance |
+------------+---------+
| 2022-01-11 |    1000 |
| 2022-02-11 |     850 |
| 2022-03-11 |    1010 |
| 2022-04-11 |    1210 |
| 2022-04-20 |    1210 |
| 2022-04-25 |    1130 |
| 2022-05-11 |     830 |
+------------+---------+

**Solutions:**
``` sql

select txndate, 
sum(
case when status = 'credit' then amount
else - amount end) over(order by txndate) as balance
from bankstatement;



select txndate, 
sum(
case when status = 'credit' then coalesce(amount,0)
else coalesce(- amount, 0) end) over(order by txndate) as balance
from bankstatement;